[
    { "name": "Sun", "description": "The Sun is a massive, glowing sphere of hot plasma at the center of our solar system. It provides the energy that sustains life on Earth and influences the orbits of all planets. Composed primarily of hydrogen and helium, the Sun undergoes nuclear fusion in its core, releasing vast amounts of light and heat." },
    { "name": "Mercury", "radius": 5, "ratio": 0.03, "sizeRatio": 0.4, "speed":  4.2, "color": "#a9a9a9", "angle": 0, "description": "Mercury is the smallest planet in the solar system and the closest to the Sun. It has extreme temperature variations between scorching days and freezing nights. Its surface is covered in craters, resembling Earth’s Moon." },
    { "name": "Venus", "radius": 8, "ratio": 0.06, "sizeRatio": 0.95, "speed":  1.6, "color": "#f5deb3", "angle": 5, "description": "Venus has a thick, toxic atmosphere rich in carbon dioxide, creating a runaway greenhouse effect. It is the hottest planet, with surface temperatures hot enough to melt lead. Despite being similar in size to Earth, its conditions are extremely hostile to life."},
    { "name": "Earth", "radius": 9, "ratio": 0.09, "sizeRatio": 1, "speed": 1, "color": "#2a52be", "angle": 15, "description": "Earth is the third planet from the Sun and the only known world to support life. It has liquid water, a breathable atmosphere, and diverse ecosystems. Earth’s dynamic geology and magnetic field protect it from harmful solar radiation."},
    { "name": "Mars", "radius": 7, "ratio": 0.14, "sizeRatio": 0.53, "speed":  0.53, "color": "#b22222", "angle": 10, "description": "Mars, the fourth planet, is often called the “Red Planet” due to its iron-rich dust. It has the tallest volcano and the deepest canyon in the solar system. Scientists believe Mars may have once had water and possibly conditions suitable for life."},
    { "name": "Jupiter", "radius": 20, "ratio": 0.23, "sizeRatio": 11, "speed":  0.294, "color": "#d2691e", "angle": 30, "description": "Jupiter is the largest planet, a massive gas giant more than twice as massive as all other planets combined. It has a Great Red Spot, a giant storm larger than Earth that has raged for centuries. Jupiter’s strong gravity influences many objects in the solar system."},
    { "name": "Saturn", "radius": 18, "ratio": 0.34, "sizeRatio": 9.4, "speed":  0.274, "color": "#deb887", "angle": 45, "description": "Saturn is famous for its stunning, complex ring system made of ice and rock. It’s the second-largest planet and a gas giant with a low average density. Saturn has more than 80 moons, including Titan, which has a thick atmosphere."},
    { "name": "Uranus", "radius": 15, "ratio": 0.56, "sizeRatio": 4, "speed":  0.242, "color": "#afeeee", "angle": 0, "description": "Uranus is an ice giant with a blue-green color caused by methane in its atmosphere. It rotates on its side, with an axial tilt of 98 degrees, making its seasons extreme. Uranus has faint rings and at least 27 known moons."},
    { "name": "Neptune", "radius": 14, "ratio": 1.0, "sizeRatio": 3.8, "speed": 0.236, "color": "#4169e1", "angle": 72, "description": "Neptune is the eighth and farthest known planet from the Sun. It’s a deep blue ice giant with supersonic winds, the fastest in the solar system. Neptune’s largest moon, Triton, orbits in the opposite direction of Neptune’s rotation, suggesting it was captured."}
]